Revit 2024 API
PlanCircuit Methods
The PlanCircuit type exposes the following members.
Methods
Name | Description
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetPointInside
Returns a point inside the circuit.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
PlanCircuit Class
Autodesk.Revit.DB Namespace